// №15 Напишите программу, которая принимает на вход цифру, обозначающую день недели, 
//     и проверяет, является ли этот день выходным.
//6 -> да
//7 -> да
//1 -> нет
//* Сделать вариант с использованием конструкции Dictionary
var Week = new Dictionary<int, string>()
{
    [1] ="Понедельник",
    [2] ="Вторник",
    [3] ="Среда",
    [4] ="Четверг",
    [5] ="Пятница",
    [6] ="Суббота",
    [7] ="Воскресенье",
};
var Weekend = new Dictionary<int, string>()
{
    [1] ="Рабочий",
    [2] ="Рабочий",
    [3] ="Рабочий",
    [4] ="Рабочий",
    [5] ="Рабочий",
    [6] ="Выходной",
    [7] ="Выходной",
};
Console.Write("Введите число: ");
int day = Convert.ToInt32(Console.ReadLine());
Console.WriteLine(Week[day] + " - " + Weekend[day]);